package 基础知识;

/**
 * @author yolo
 * @date 2019/12/6-18:50
 * 1.网络分类：
 *      广域，城域，局域
 * 2.什么是协议：
 * 3.什么是标准：
 * 4.协议分层：
 *      OSI（七层）：
 *      TCP／IP（四层）：
 *      五层协议：（重点）
 *          应用层：HTTP，DNS，HTML
 *          运输层：TCP，UDP
 *          网络层：IP
 *          数据链路层／链路层
 *          物理层
 *  5.网络传输的基本流程
 *      ①理解局域网中链路层(通过网之间进行互联的设备之间）如何通信
 *          数据的传播具有广播的特性（一个结点发送数据，所有结点都可以收到）
 *          数据中带着名字（MAC地址），只有MAC地址一样的结点才接收数据
 *          冲突域：冲突检测＋冲突避免（等待的时间是随机的）
 *          交换机：不会隔离冲突域（类似于不带红绿灯的十字路口，并不会隔离冲突区）
 *       解包：接触需要的数据
 *       分用：数据如何交给上层谁？
 *      ②跨局域网数据如何通信
 *
 *
 *
 *
 *
 *
 *
 */
public class Demo01 {

}
